it/src/Documents/ВводНачальныхОстатковОС/ВводНачальныхОстатковОС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВводНачальныхОстатковОС</name>
  <registerRecords>InformationRegister.ПоддержкаЛицензий</registerRecords>
  <registerRecords>AccumulationRegister.ЛицензииОрганизации</registerRecords>
  <registerRecords>InformationRegister.КомплектующиеОС</registerRecords>
  <registerRecords>InformationRegister.ПервоначальныеСведенияОС</registerRecords>
  <registerRecords>InformationRegister.МестонахождениеОС</registerRecords>
  <registerRecords>AccumulationRegister.Закупки</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Событие</name>
    <type>
      <types>CatalogRef.СобытияОС</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОсновныеСредства</name>
    <attributes>
      <name>ДатаВводаВЭксплуатацию</name>
      <comment>(Упр)</comment>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПринятияКУчету</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОсновноеСредство</name>
      <type>
        <types>CatalogRef.ОсновныеСредства</types>
      </type>
    </attributes>
    <attributes>
      <name>ПодразделениеОрганизации</name>
      <type>
        <types>CatalogRef.ПодразделенияОрганизаций</types>
      </type>
    </attributes>
    <attributes>
      <name>Помещение</name>
      <type>
        <types>CatalogRef.Помещение</types>
      </type>
    </attributes>
    <attributes>
      <name>МОЛ</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>ПервоначальнаяСтоимость</name>
      <comment>(Упр)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачалаПоддержки</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СрокДействия_Месяц</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИмяДомена</name>
      <type>
        <types>CatalogRef.ИдентификаторыДоменов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Комплектующие</name>
    <attributes>
      <name>ОсновноеСредство</name>
      <type>
        <types>CatalogRef.ОсновныеСредства</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

it/src/Enums/ВидДвиженияНакопления/ВидДвиженияНакопления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидДвиженияНакопления</name>
  <enumValues>
    <name>Расход</name>
  </enumValues>
  <enumValues>
    <name>Приход</name>
  </enumValues>
</mdclass:Enum>

it/src/Documents/ВводНачальныхОстатковОС/ManagerModule.bsl
// Получить таблицу .
//
Функция ПолучитьТаблицуПервоначальныеСведенияОС(СтруктураШапкиДокумента) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВводНачальныхОстатковОСОсновныеСредства.Ссылка КАК Регистратор,
	               |	ВводНачальныхОстатковОСОсновныеСредства.Ссылка.Дата КАК Период,
	               |	ВводНачальныхОстатковОСОсновныеСредства.ОсновноеСредство,
	               |	ВводНачальныхОстатковОСОсновныеСредства.ПервоначальнаяСтоимость КАК Стоимость
	               |ИЗ
	               |	Документ.ВводНачальныхОстатковОС.ОсновныеСредства КАК ВводНачальныхОстатковОСОсновныеСредства
	               |ГДЕ
	               |	ВводНачальныхОстатковОСОсновныеСредства.Ссылка = &Ссылка";
	
	 Запрос.УстановитьПараметр("Ссылка",СтруктураШапкиДокумента.Ссылка);
	 Возврат(Запрос.Выполнить().Выгрузить());
	 
КонецФункции // 

// Получить таблицу .
//
Функция ПолучитьТаблицуМестонахождениеОС(СтруктураШапкиДокумента) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВводНачальныхОстатковОСКомплектующие.Ссылка КАК Регистратор,
	               |	ВводНачальныхОстатковОСКомплектующие.Ссылка.Дата КАК Период,
	               |	ВводНачальныхОстатковОСКомплектующие.ОсновноеСредство,
	               |	ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка) КАК Организация,
	               |	ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка) КАК ПодразделениеОрганизации,
	               |	ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка) КАК МОЛ,
	               |	ЗНАЧЕНИЕ(Справочник.Помещение.ПустаяСсылка) КАК Помещение,
	               |	ВводНачальныхОстатковОСОсновныеСредства.ОсновноеСредство КАК ОСВладелец,
	               |	ВводНачальныхОстатковОСОсновныеСредства.ИмяДомена
	               |ИЗ
	               |	Документ.ВводНачальныхОстатковОС.Комплектующие КАК ВводНачальныхОстатковОСКомплектующие
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВводНачальныхОстатковОС.ОсновныеСредства КАК ВводНачальныхОстатковОСОсновныеСредства
	               |		ПО ВводНачальныхОстатковОСКомплектующие.КлючСвязи = ВводНачальныхОстатковОСОсновныеСредства.КлючСвязи
	               |			И ВводНачальныхОстатковОСКомплектующие.Ссылка = ВводНачальныхОстатковОСОсновныеСредства.Ссылка
	               |ГДЕ
	               |	ВводНачальныхОстатковОСКомплектующие.Ссылка = &Ссылка
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ВводНачальныхОстатковОСОсновныеСредства.Ссылка,
	               |	ВводНачальныхОстатковОСОсновныеСредства.Ссылка.Дата,
	               |	ВводНачальныхОстатковОСОсновныеСредства.ОсновноеСредство,
	               |	ВводНачальныхОстатковОСОсновныеСредства.Ссылка.Организация,
	               |	ВводНачальныхОстатковОСОсновныеСредства.ПодразделениеОрганизации,
	               |	ВводНачальныхОстатковОСОсновныеСредства.МОЛ,
	               |	ВводНачальныхОстатковОСОсновныеСредства.Помещение,
	               |	ЗНАЧЕНИЕ(Справочник.ОсновныеСредства.ПустаяСсылка),
	               |	ВводНачальныхОстатковОСОсновныеСредства.ИмяДомена
	               |ИЗ
	               |	Документ.ВводНачальныхОстатковОС.ОсновныеСредства КАК ВводНачальныхОстатковОСОсновныеСредства
	               |ГДЕ
	               |	ВводНачальныхОстатковОСОсновныеСредства.Ссылка = &Ссылка";
	
	 Запрос.УстановитьПараметр("Ссылка",СтруктураШапкиДокумента.Ссылка);
	 Возврат(Запрос.Выполнить().Выгрузить());
	 
КонецФункции // 

// Получить таблицу .
//
Функция ПолучитьТаблицуКомплектующиеОС(СтруктураШапкиДокумента) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВводНачальныхОстатковОСКомплектующие.Ссылка КАК Регистратор,
	               |	ВводНачальныхОстатковОСКомплектующие.Ссылка.Дата КАК Период,
	               |	ЗНАЧЕНИЕ(Перечисление.ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	               |	ВводНачальныхОстатковОСОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство,
	               |	ВводНачальныхОстатковОСКомплектующие.ОсновноеСредство КАК Комплектующая
	               |ИЗ
	               |	Документ.ВводНачальныхОстатковОС.Комплектующие КАК ВводНачальныхОстатковОСКомплектующие
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВводНачальныхОстатковОС.ОсновныеСредства КАК ВводНачальныхОстатковОСОсновныеСредства
	               |		ПО ВводНачальныхОстатковОСКомплектующие.КлючСвязи = ВводНачальныхОстатковОСОсновныеСредства.КлючСвязи
	               |			И ВводНачальныхОстатковОСКомплектующие.Ссылка = ВводНачальныхОстатковОСОсновныеСредства.Ссылка
	               |ГДЕ
	               |	ВводНачальныхОстатковОСКомплектующие.Ссылка = &Ссылка";
	
	 Запрос.УстановитьПараметр("Ссылка",СтруктураШапкиДокумента.Ссылка);
	 Возврат(Запрос.Выполнить().Выгрузить());
	 
КонецФункции // 

// Получить таблицу .
//
Функция ПолучитьТаблицуПоддержкиЛицензий(СтруктураШапкиДокумента) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВводНачальныхОстатковОСОсновныеСредства.Ссылка КАК Регистратор,
	               |	ВводНачальныхОстатковОСОсновныеСредства.ОсновноеСредство,
	               |	ВводНачальныхОстатковОСОсновныеСредства.ДатаНачалаПоддержки КАК ДатаНачала,
	               |	ВводНачальныхОстатковОСОсновныеСредства.СрокДействия_Месяц
	               |ИЗ
	               |	Документ.ВводНачальныхОстатковОС.ОсновныеСредства КАК ВводНачальныхОстатковОСОсновныеСредства
	               |ГДЕ
	               |	ВводНачальныхОстатковОСОсновныеСредства.Ссылка = &Ссылка
	               |	И ВводНачальныхОстатковОСОсновныеСредства.ДатаНачалаПоддержки <> ДАТАВРЕМЯ(1, 1, 1)";
	
	 Запрос.УстановитьПараметр("Ссылка",СтруктураШапкиДокумента.Ссылка);
	 Возврат(Запрос.Выполнить().Выгрузить());
	 
КонецФункции //
